In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
data = {'Country':['Belgium', 'India', 'Brazil'],
       'Capital':['Brussels','New Delhi', 'Brasilia'],
       'Population':[11190846, 1303171035, 207847528]}

# Series

In [4]:
s1 = pd.Series(data['Country'])

In [5]:
s1

0    Belgium
1      India
2     Brazil
dtype: object

In [7]:
s1.values

array(['Belgium', 'India', 'Brazil'], dtype=object)

In [8]:
s1.index

RangeIndex(start=0, stop=3, step=1)

In [9]:
s1 = pd.Series(data['Country'],index=['A','B','C'])

In [10]:
s1

A    Belgium
B      India
C     Brazil
dtype: object

In [11]:
s1.values

array(['Belgium', 'India', 'Brazil'], dtype=object)

In [12]:
s1.index

Index(['A', 'B', 'C'], dtype='object')

# Dataframe

In [14]:
df1 = pd.DataFrame(data)

In [15]:
df1

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [16]:
df1['Country']

0    Belgium
1      India
2     Brazil
Name: Country, dtype: object

In [17]:
cou = df1['Country']

In [18]:
type(cou)

pandas.core.series.Series

In [19]:
df1.iterrows()

In [23]:
for row in df1.iterrows():
    print(row),print(type(row)),print(len(row))

(0, Country        Belgium
Capital       Brussels
Population    11190846
Name: 0, dtype: object)
<class 'tuple'>
2
(1, Country            India
Capital        New Delhi
Population    1303171035
Name: 1, dtype: object)
<class 'tuple'>
2
(2, Country          Brazil
Capital        Brasilia
Population    207847528
Name: 2, dtype: object)
<class 'tuple'>
2

In [26]:
for row in df1.iterrows():
    print(type(row[0]),row[0],row[1])
    break

<class 'int'> 0 Country        Belgium
Capital       Brussels
Population    11190846
Name: 0, dtype: object

In [27]:
for row in df1.iterrows():
    print(type(row[0]),type(row[1]))
    break

<class 'int'> <class 'pandas.core.series.Series'>

In [28]:
df1

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [29]:
data

{'Country': ['Belgium', 'India', 'Brazil'],
 'Capital': ['Brussels', 'New Delhi', 'Brasilia'],
 'Population': [11190846, 1303171035, 207847528]}

In [62]:
s1 = pd.Series(data['Country'])

In [63]:
s2 = pd.Series(data['Capital'])

In [64]:
s3 = pd.Series(data['Population'])

In [66]:
df_new = pd.DataFrame([s1,s2,s3])

In [67]:
df_new

          0           1          2
0   Belgium       India     Brazil
1  Brussels   New Delhi   Brasilia
2  11190846  1303171035  207847528

In [48]:
df1

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [49]:
df_new = df_new.T

In [50]:
df_new

         0          1           2
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [51]:
df1

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [70]:
df_new = pd.DataFrame([s1,s2,s3], index=['Country','Capital','Population'])

In [71]:
df_new

                   0           1          2
Country      Belgium       India     Brazil
Capital     Brussels   New Delhi   Brasilia
Population  11190846  1303171035  207847528

In [72]:
df_new = df_new.T

In [73]:
df1

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [74]:
df_new

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528